In [1]:
import pandas as pd
import sqlalchemy

In [10]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:2002@localhost:3306/shopdb')

In [11]:
df = pd.read_sql_table("customers",engine)

In [12]:
df

   CustomerID CustomerName ContactName Country
0           1     John Doe        John     USA
1           2   Jane Smith        Jane  Canada
2           3   Paul Brown        Paul      UK
3           4        Rohit       Rohit   India